Este comando lista os ficheiros:
$ ls
>>>
exemplo2.nb
exemplo.nb
lib
main.c
Makefile
notebook
obj
<<<
Agora podemos ordenar estes ficheiros:
$| sort
>>>
exemplo2.nb
exemplo.nb
lib
main.c
Makefile
notebook
obj
<<<
E escolher o primeiro:
$| head -1
>>>
exemplo2.nb
<<<
Mostrar processos em execução:
$ ps
>>>
  PID TTY          TIME CMD
  398 pts/0    00:00:00 memcheck-amd64-
  408 pts/0    00:00:00 ps
 9089 pts/0    00:00:00 notebook
 9310 pts/0    00:00:00 sort <defunct>
21104 pts/0    00:00:00 gdb
29681 pts/0    00:00:00 bash
<<<
Mostrar o "Working directory":
$ pwd
>>>
/home/mont3iro68/Documents/SO/TP/SO-18/src
<<<
Mostrar permissões e ficheiros ocultos:
$ ls -la
>>>
total 80
drwxr-xr-x 4 mont3iro68 mont3iro68  4096 jun  2 23:44 .
drwxr-xr-x 5 mont3iro68 mont3iro68  4096 jun  2 23:52 ..
-rw-r--r-- 1 mont3iro68 mont3iro68  6148 mai  1 16:15 .DS_Store
-rw-r--r-- 1 mont3iro68 mont3iro68  3306 jun  2 23:53 exemplo2.nb
-rw-r--r-- 1 mont3iro68 mont3iro68  4715 jun  2 23:51 exemplo.nb
drwxr-xr-x 2 mont3iro68 mont3iro68  4096 jun  2 20:40 lib
-rw-r--r-- 1 mont3iro68 mont3iro68  1178 jun  2 23:43 main.c
-rw-r--r-- 1 mont3iro68 mont3iro68   558 jun  2 15:08 Makefile
-rwxr-xr-x 1 mont3iro68 mont3iro68 35584 jun  2 23:44 notebook
drwxr-xr-x 3 mont3iro68 mont3iro68  4096 jun  2 23:44 obj
<<<
Mostrar periféricos do computador:
$ lspci
>>>
00:00.0 Host bridge: Intel Corporation Broadwell-U Host Bridge -OPI (rev 09)
00:02.0 VGA compatible controller: Intel Corporation HD Graphics 5500 (rev 09)
00:03.0 Audio device: Intel Corporation Broadwell-U Audio Controller (rev 09)
00:14.0 USB controller: Intel Corporation Wildcat Point-LP USB xHCI Controller (rev 03)
00:16.0 Communication controller: Intel Corporation Wildcat Point-LP MEI Controller #1 (rev 03)
00:1b.0 Audio device: Intel Corporation Wildcat Point-LP High Definition Audio Controller (rev 03)
00:1c.0 PCI bridge: Intel Corporation Wildcat Point-LP PCI Express Root Port #1 (rev e3)
00:1c.2 PCI bridge: Intel Corporation Wildcat Point-LP PCI Express Root Port #3 (rev e3)
00:1c.3 PCI bridge: Intel Corporation Wildcat Point-LP PCI Express Root Port #4 (rev e3)
00:1c.4 PCI bridge: Intel Corporation Wildcat Point-LP PCI Express Root Port #5 (rev e3)
00:1d.0 USB controller: Intel Corporation Wildcat Point-LP USB EHCI Controller (rev 03)
00:1f.0 ISA bridge: Intel Corporation Wildcat Point-LP LPC Controller (rev 03)
00:1f.2 SATA controller: Intel Corporation Wildcat Point-LP SATA Controller [AHCI Mode] (rev 03)
00:1f.3 SMBus: Intel Corporation Wildcat Point-LP SMBus Controller (rev 03)
02:00.0 Ethernet controller: Realtek Semiconductor Co., Ltd. RTL8111/8168/8411 PCI Express Gigabit Ethernet Controller (rev 15)
03:00.0 Network controller: Qualcomm Atheros QCA9377 802.11ac Wireless Network Adapter (rev 30)
04:00.0 3D controller: NVIDIA Corporation GM108M [GeForce 940M] (rev ff)
<<<
Verificar conexões de rede:
$ ifconfig
>>>
enp2s0: flags=4099<UP,BROADCAST,MULTICAST>  mtu 1500
        ether 2c:60:0c:f5:c4:97  txqueuelen 1000  (Ethernet)
        RX packets 0  bytes 0 (0.0 B)
        RX errors 0  dropped 0  overruns 0  frame 0
        TX packets 0  bytes 0 (0.0 B)
        TX errors 0  dropped 0 overruns 0  carrier 0  collisions 0
        device interrupt 49  base 0x9000  

lo: flags=73<UP,LOOPBACK,RUNNING>  mtu 65536
        inet 127.0.0.1  netmask 255.0.0.0
        inet6 ::1  prefixlen 128  scopeid 0x10<host>
        loop  txqueuelen 1000  (Local Loopback)
        RX packets 400  bytes 30384 (29.6 KiB)
        RX errors 0  dropped 0  overruns 0  frame 0
        TX packets 400  bytes 30384 (29.6 KiB)
        TX errors 0  dropped 0 overruns 0  carrier 0  collisions 0

wlp3s0: flags=4163<UP,BROADCAST,RUNNING,MULTICAST>  mtu 1500
        inet 192.168.1.222  netmask 255.255.255.0  broadcast 192.168.1.255
        inet6 fe80::e899:3f4a:e715:bbc6  prefixlen 64  scopeid 0x20<link>
        ether 18:4f:32:d5:a2:d5  txqueuelen 1000  (Ethernet)
        RX packets 127471  bytes 89208785 (85.0 MiB)
        RX errors 0  dropped 19762  overruns 0  frame 0
        TX packets 35248  bytes 6520585 (6.2 MiB)
        TX errors 0  dropped 0 overruns 0  carrier 0  collisions 0

<<<
Encontrar ocorrencias de "inet":
$| grep inet
>>>
        inet 127.0.0.1  netmask 255.0.0.0
        inet6 ::1  prefixlen 128  scopeid 0x10<host>
        inet 192.168.1.222  netmask 255.255.255.0  broadcast 192.168.1.255
        inet6 fe80::e899:3f4a:e715:bbc6  prefixlen 64  scopeid 0x20<link>
<<<
Ficar com os 2 primeiros da lista do :
$4| head -2
>>>
total 80
drwxr-xr-x 4 mont3iro68 mont3iro68  4096 jun  2 23:44 .
<<<
Encontrar o nome e pid do nosso processo:
$7| grep notebook
>>>
 9089 pts/0    00:00:00 notebook
<<<
